eisup_2019_docmng_integration/src/InformationRegisters/НДФЛСтандартныеВычетыНаДетей/НДФЛСтандартныеВычетыНаДетей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НДФЛСтандартныеВычетыНаДетей</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоДетей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДетейЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВычетыНДФЛ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/НДФЛСтандартныеВычетыНаДетей/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьКоличествоДетейЗавершения(НаборЗаписей)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Данные",НаборЗаписей.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыНаДетей.Период,
	|	НДФЛСтандартныеВычетыНаДетей.Физлицо,
	|	НДФЛСтандартныеВычетыНаДетей.КодВычета,
	|	НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения,
	|	НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&Данные КАК НДФЛСтандартныеВычетыНаДетей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.Период,
	|	СрезПоследних.Физлицо,
	|	СрезПоследних.КодВычета,
	|	СрезПоследних.ПериодЗавершения,
	|	СрезПоследних.КоличествоДетей,
	|	ВЫБОР
	|		КОГДА НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <= СрезПоследних.Период
	|				И НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА НДФЛСтандартныеВычетыНаДетей.КоличествоДетейЗавершения
	|		ИНАЧЕ НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	|	КОНЕЦ КАК КоличествоДетейЗавершения
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборЗаписей.Период КАК Период,
	|		НаборЗаписей.Физлицо КАК Физлицо,
	|		НаборЗаписей.КодВычета КАК КодВычета,
	|		НаборЗаписей.ПериодЗавершения КАК ПериодЗавершения,
	|		НаборЗаписей.КоличествоДетей КАК КоличествоДетей,
	|		МАКСИМУМ(НДФЛСтандартныеВычетыНаДетей.Период) КАК ПериодСреза
	|	ИЗ
	|		ВТНаборЗаписей КАК НаборЗаписей
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|			ПО НаборЗаписей.Физлицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|				И НаборЗаписей.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	|				И НаборЗаписей.Период > НДФЛСтандартныеВычетыНаДетей.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборЗаписей.Период,
	|		НаборЗаписей.Физлицо,
	|		НаборЗаписей.КодВычета,
	|		НаборЗаписей.ПериодЗавершения,
	|		НаборЗаписей.КоличествоДетей) КАК СрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|		ПО СрезПоследних.Физлицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|			И СрезПоследних.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	|			И СрезПоследних.ПериодСреза = НДФЛСтандартныеВычетыНаДетей.Период";
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

	Если Количество() > 0 Тогда
		ЗаполнитьКоличествоДетейЗавершения(ЭтотОбъект)	
	КонецЕсли;
	
КонецПроцедуры
